news_scrap/app/controllers/home_controller.rb

  def index
    @keywords = Keyword.all
---
SELECT "keywords".* FROM "keywords"