news_scrap/app/controllers/keywords_controller.rb

SELECT "keywords".* FROM "keywords"
---
  def index
    @keywords = Keyword.all

INSERT INTO "keywords" ("title", "on_alarm", "exeption", "created_at", "updated_at") VALUES ('마이크로소프트', FALSE, NULL, '2026-01-16 08:22:44.189764', '2026-01-16 08:22:44.189764') RETURNING "id"
---
  def create
    @keyword = Keyword.new(keyword_params)

    if @keyword.save

SELECT "keywords".* FROM "keywords" WHERE "keywords"."id" = 2 LIMIT 1
---
  def show
    @keyword = Keyword.find(params[:id])

SELECT "keywords".* FROM "keywords" WHERE "keywords"."id" = 2 LIMIT 1
UPDATE "keywords" SET "on_alarm" = FALSE, "updated_at" = '2026-01-16 09:02:34.720832' WHERE "keywords"."id" = 2
---
  def update
    @keyword = Keyword.find(params[:id])

    @keyword.update!(on_alarm: !@keyword.on_alarm)

SELECT "keywords".* FROM "keywords" WHERE "keywords"."id" = 2 LIMIT 1
UPDATE "keywords" SET "on_alarm" = FALSE, "updated_at" = '2026-01-16 09:02:36.361447' WHERE "keywords"."id" = 2
---
  def toggle_alarm
    @keyword = Keyword.find(params[:id])

    @keyword.update!(on_alarm: !@keyword.on_alarm)